Table of Contents
 Class ResultOfInternalForces
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of internal forces in the one position
[Obfuscation(Feature = "renaming")]
public class ResultOfInternalForces : SectionResultBase
Inheritance
object
SectionResultBase
ResultOfInternalForces
Inherited Members
 SectionResultBase.Loading
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Remarks
Convention of internal forces on 1D members
 Internal forces on 1D members perform following actions:
 • positive bending moment My causes tension in cross-section fibers with negative z-coordinate
 • positive bending moment Mz causes tension in fibers with negative y-coordinate
 • positive torsional moment Mx acts about x-axis of 1D member
 • positive axial force N acts in direction of x-axis of member and causes tension in cross-section fibers
 • positive shear force Qz acts in direction of z-axis of cross-section
 • positive shear force Qy acts in direction of y-axis of cross-section
Constructors
 ResultOfInternalForces()
Constructor
public ResultOfInternalForces()
Properties
 Mx
Bending moment around x-axis
public double Mx { get; set; }
Property Value
double
 My
Bending moment around y-axis
public double My { get; set; }
Property Value
double
 Mz
Bending moment around z-axis
public double Mz { get; set; }
Property Value
double
 N
Normal force
public double N { get; set; }
Property Value
double
 Qy
Shear force in y dirrection
public double Qy { get; set; }
Property Value
double
 Qz
Shear force in z dirrection
public double Qz { get; set; }
Property Value
double
 Edit this page